"""
Настройки приложения
"""

# Символы валют
CURRENCY_SYMBOLS = {
    "RUB": "₽",
    "USD": "$",
    "EUR": "€",
    "GBP": "£",
    "CNY": "¥",
    "JPY": "¥",
}

# Названия торговых площадок
BOARD_NAMES = {
    "TQBR": "Т+: Акции и ДР",
    "TQCB": "Т+: Облигации",
    "TQIR": "Т+: Иностранные ценные бумаги",
    "TQTD": "Т+: Торговые расписки",
    "TQIF": "Т+: Паи ПИФов",
    "TQOB": "Т+: Облигации (ОТС)",
    "TQOS": "Т+: Акции (ОТС)",
    "CETS": "Валютный рынок",
    "EQBR": "Основной режим: Акции и ДР",
    "EQCB": "Основной режим: Облигации",
    "EQIR": "Основной режим: Иностранные ценные бумаги",
    "EQTD": "Основной режим: Торговые расписки",
    "EQIF": "Основной режим: Паи ПИФов",
    "EQOB": "Основной режим: Облигации (ОТС)",
    "EQOS": "Основной режим: Акции (ОТС)",
    "SMAL": "Малый пакет",
    "SPEQ": "Специальный режим",
    "SPOB": "Специальный режим: Облигации",
}
