"""Шаблоны текстов для опроса"""

WELCOME_TEXT = """Приветствую!
На связи Данила Ладнюк и я квалифицированный инвестор.
Пройди короткий инвестиционный опрос до конца
И получи шанс выиграть поездку в Дубай ✈️🇦🇪
Опрос займет 3–5 минут
Начинаем?🔥 
"""

SUBSCRIPTION_REQUIRED_TEXT = """Чтобы участвовать в опросе и розыгрыше — 
нужно быть подписчиком моего канала

P.S. В канале есть подсказки для ответов в опросе🤫 
"""

START_POLL_TEXT = """Отлично. Поехали 🚀

Ниже несколько вопросов про инвестиции
Отвечай честно. Неправильные ответы можно исправлять"""

QUESTION_TEXT = """Вопрос {question_number} из {total_questions}

{question_text}"""

CORRECT_ANSWER_TEXT = """Верно 👍

Идем дальше"""

INCORRECT_ANSWER_TEXT = """Не совсем

Подсказка:
{hint}

Эксперт разбирал этот вопрос в своем канале"""

MID_POLL_REMINDER_TEXT = """Ты уже на полпути

Кстати, в канале эксперта есть разборы
которые помогают отвечать быстрее 😉"""

POLL_COMPLETED_TEXT = """А ты, смотрю, очень очень хочешь в Дубай🇦🇪
Так держать🤝

Пригласи друга пройти опрос до конца и получи +1 шанс в розыгрыше
Чем больше твоих друзей пройдут опрос  — тем выше вероятность твоей победы

Твоя персональная ссылка: {ref_link}

Кого пригласишь первым? 
"""

REFERRAL_SCREEN_TEXT = """За каждого друга, который пройдет опрос до конца
ты получишь +1 шанс в розыгрыше

Чем больше друзей — тем выше вероятность победы

Твоя персональная ссылка:
{ref_link}"""

MY_CHANCES_TEXT = """Твои шансы на победу

{referrals_count} - Перешло друзей по твоей ссылке и решили опрос до конца 
{total_chances} - Твои шансы на победу

Розыгрыш состоится в *конкретная дата* 
Победителя объявлю в своём канале — не пропусти!
"""

ALREADY_COMPLETED_TEXT = """Ты уже участвуешь в розыгрыше 🎟

Текущие шансы: {chances}

Можешь увеличить их, пригласив друзей"""

WINNER_TEXT = """Ты выиграл поездку в Дубай ✈️🇦🇪

Мы скоро свяжемся с тобой для деталей"""

NOT_WINNER_TEXT = """Спасибо за участие

Эксперт продолжит делиться инвестиционными идеями в канале
Оставайся с нами"""
